<template>
    <div class="p-4 mont flex flex-row">
        <img src="~/assets/lewiscaroll.jpg" alt="Льюіс Керрол" class="h-1/3 ml-4 mb-4 mr-32">
        <div class="flex flex-col">
            <p class="text-2xl pb-8">
                Лью́їс Ке́ррол (англ. Lewis Carroll)
            </p>
            <div class="text-xl mb-2">
                Лью́їс Ке́ррол (англ. Lewis Carroll, справжнє ім'я Чарльз Ла́твідж (Лю́твідж) До́джсон, Charles Lutwidge Dodgson; 1832 — 1898) — англійський письменник, математик, філософ, логік, англіканський клірик (священник, теолог) і фотограф.
            </div>
            <div class="mb-2">
                Найвідоміші літературні твори Керролла: 
                <UButton variant="link" to="https://uk.wikipedia.org/wiki/%D0%9F%D1%80%D0%B8%D0%B3%D0%BE%D0%B4%D0%B8_%D0%90%D0%BB%D1%96%D1%81%D0%B8_%D1%83_%D0%94%D0%B8%D0%B2%D0%BE%D0%BA%D1%80%D0%B0%D1%97">«Пригоди Аліси у Дивокраї» (Alice's Adventures in Wonderland)</UButton>
                і продовження
                <UButton variant="link" to="https://uk.wikipedia.org/wiki/%D0%90%D0%BB%D1%96%D1%81%D0%B0_%D0%B2_%D0%97%D0%B0%D0%B4%D0%B7%D0%B5%D1%80%D0%BA%D0%B0%D0%BB%D0%BB%D1%96">«Аліса в задзеркаллі» (Through the Looking-Glass)</UButton>
                , а також поеми 
                <UButton variant="link" to="https://uk.wikipedia.org/wiki/%D0%9F%D0%BE%D0%BB%D1%8E%D0%B2%D0%B0%D0%BD%D0%BD%D1%8F_%D0%BD%D0%B0_%D0%A1%D0%BD%D0%B0%D1%80%D0%BA%D0%B0"> «Полювання на Снарка» (The Hunting of the Snark)</UButton> 
                і 
                <UButton variant="link" to="https://uk.wikipedia.org/wiki/%D0%9A%D1%83%D1%80%D0%B7%D1%83-%D0%92%D0%B5%D1%80%D0%B7%D1%83">«Бурмоковт» (Jabberwocky: Jabber — балаканина, wacky — ідіотський, божевільний)</UButton>.
            </div>
            <div class="mb-4">
                Легкість у грі слів, логіці й фантазії задовольняють широку читацьку аудиторію, починаючи від дітей, закінчуючи літературною елітою. Разом з тим, його твори глибоко пов'язалися з сучасною культурою: вони прямо вплинули на творчість багатьох митців — утворилися спільноти, присвячені отриманню естетичного задоволення, сприянню поширення творів і дослідженню життя автора в багатьох країнах світу, зокрема в Північній Америці, Японії, Великій Британії та Новій Зеландії.
            </div>
            <UDivider class="text-2xl font-extrabold cursor-pointer mb-8" @click="toggleBio">Біографія</UDivider>
            <div v-if="bioExpand">
                <div class="mb-2">
                    Народився у гравстві Чешир. Сім'я Доджсонів мала переважно північноанглійські корені з певними ірландськими зв'язками. Консервативні та прихильники Високої Церкви — напряму в англіканській церкві, який тяжів до католицизму (High Church Anglican), більшість предків Доджсонів були армійськими офіцерами або клериками англіканської церкви. Прадід Керрола, якого також звали Чарльз Доджсон, пройшов усі церковні ранги і став єпископом; дід, ще один Чарльз, був армійським капітаном і загинув в бойових діях 1803 р., коли двоє його синів були ще майже дітьми. Старший з цих синів — черговий Чарльз — був батьком Керрола: він повернувся до іншого сімейного покликання і прийняв священничий сан. Учився в Школі Реґбі (Раґбі-Скул, англ. Rugby School), а потім в оксфордській Церкві Христа (Christ Church, Oxford); був математично обдарований і двічі виборов першу вчену ступінь, що відкривало шлях до блискучої академічної кар'єри. Замість цього він одружився з двоюрідною сестрою в 1827 р. — і відійшов в невідомість, ставши сільським священиком.
                </div>
                <div class="mb-2">
                    Батько юного Чарльза був активним і вельми консервативним клериком англіканської церкви, який часом вдавався до напружених релігійних диспутів, що розділяли англіканську церкву. Будучи членом Високої Церкви, схильної до Англо-католицизму, шанувальником кардинала Ньюмена і Тракторіанського руху, він вважав за найкраще прищеплювати такі погляди своїм дітям. Проте юний Чарльз виявляв сумніви щодо релігійних цінностей батька і англіканської церкви в цілому.
                </div>
                <div class="mb-2 w-full text-center text-xl">
                    Одна людина — дві особистості
                </div>
                <div class="mb-2">
                    Сама собою склалася звичка говорити про цього письменника як про двох зовсім різних людей. Перший, <strong>Чарлз Лутвідж Доджсон</strong>, — солідний професор математики, занурений у формули та цифри, нудний і прискіпливий викладач, похмурий і відлюдькуватий джентельмен, який не терпів втручань у своє особисте життя й ретельно дотримувався встановленого розпорядку дня, автор наукових праць.<br>
                </div>
                <div class="mb-2">
                    Другий, <strong>Льюїс Керрол</strong>, — фантазер і дотепний жартівник, невтомний винахідник розваг і розіграшів, завзятий театрал, майстер фотографії, кращий друг дітей, автор чудернацьких казок, що уславили його як «короля нісенітниць».<br>
                </div>
                <div class="mb-2">
                    Як співіснували ці дві протилежні особистості в одній людині, так і залишилося загадкою...
                </div>
                
                <div class="mb-2 w-full text-center text-xl">
                    Юність
                </div>
                <div class="mb-2">
                    Юний Доджсон народився в домі сільського священика в селі Дерсбері (Daresbury) поблизу Ворінгтона, графство Чешир. Він був найстаршим хлопчиком, але третьою дитиною від шлюбу, якому було чотири з половиною роки. Після Чарльза народилося ще восьмеро дітей, рідкісно для того часу, всі діти — семеро дівчат і четверо хлопців (включаючи Едвіна Доджсона) дожили до зрілого віку. Коли Чарльзу виповнилося 11 років, батько переїхав в Крофт-на-Тіз (Croft-on-Tees) в північному Йоркширі, і вся родина переїхала в просторий дім парафіяльного священника. Вони жили в цьому домі наступні 25 років.
                </div>
                <div class="mb-2">
                    Освіту юний Доджсон почав в домашніх умовах. Його «читацький щоденник», який зберігався в сім'ї, свідчить про не за роками розвинутий інтелект: у семирічному віці дитина прочитала алегоричну новелу «Мандрівку пілігрима» (The Pilgrim's Progress) Джона Баньяна. Він також страждав від заїкуватості — була притаманна також його братам і сестрам — яка багато разів впливала на його соціальні стосунки протягом життя. В дванадцять років його відправили в невелику приватну школу біля Річмонду, де йому трапилося бути щасливим і зрівноваженим. Але в 1845 році Чарльз переходить до Рагбі-Скул. «Відтоді як я прийшов у Рагбі, я не мав учня його віку, який подавав би такі надії», — відзначав вчитель математики Р. Б. Мейджор.
                </div>
                <div class="mb-2 w-full text-center text-xl">
                    Оксфорд
                </div>
                <div class="mb-2">
                    Він залишив Рагбі наприкінці 1849 року і після перерви, причини якої залишились нез'ясованими, продовжив навчання, вступивши в січні 1851 року в Оксфорд, де став студентом старого батькового коледжу — Церкви Христа. Він пробув в Оксфорді лише два дні, коли отримав виклик додому. Його мати померла від «запалення мозку» — можливо менінгіту чи інсульту — у віці 47 років. Його рання академічна кар'єра роздиралась між подаванням величезних надій і непереборним відволіканням від навчання. Він міг не завжди часто працювати, але він був виключно обдарованим і досягнення легко приходили до нього. Отримавши першість в публічному екзамені на ступінь бакалавра в 1852, він незабаром був номінований на студентську стипендію старим другом його батька каноніком Едвардом П'юзі. Однією з вимог до роботи Льюїса Керролла була безшлюбність, целібат (умова поширювалась на деяких викладачів Оксфорда), і він вірив, що секс суперечив Божій волі.
                </div>
                <div class="mb-2 w-full text-center texl-xl">
                    Походження псевдоніма
                </div>
                <div class="mb-2">
                    Всесвітньо відомий псевдонім професора математики Доджсона було утворено такою вподобаною письменником грою слів. А саме, англійське <strong>Charles Lutwidge</strong> спочатку було задаптовано до латини. Після цього отримане ім'я <strong>Carolus Ludovicus</strong> Доджсон переклав англійською і переставив слова місцями, явивши світу <strong>Lewis Carroll — Льюїса Керрола</strong>.
                </div>
            </div>
            <UDivider class="text-2xl font-extrabold cursor-pointer mb-8" @click="togglePoems">Твори</UDivider>
            <div class="poems" v-if="poemsExpand">
                <div v-for="poem in poems">
                    <div class="mb-2">
                        <UButton size="lg" class="text-lg" variant="link" :to="poem.link">• {{ poem.title }}</UButton>
                    </div>
                </div>
            </div>
        </div>
    </div>
</template>
<style scoped>
</style>
<script setup>
const bioExpand = ref(false)
const poemsExpand = ref(false)
const toggleBio = () => {
    bioExpand.value = !bioExpand.value
}
const togglePoems = () => {
    poemsExpand.value = !poemsExpand.value
}
const poems = [
    {
        title: "Alice's Adventures in Wonderland",
        link: "https://en.wikipedia.org/wiki/Alice%27s_Adventures_in_Wonderland"
    },
    {
        title: "An Elementary Treatise on Determinants, With Their Application to Simultaneous Linear Equations and Algebraic Equations",
        link: "https://books.google.pl/books/about/An_Elementary_Treatise_on_Determinants.html?id=maNXAAAAYAAJ&redir_esc=y"
    },
    {
        title: "Euclid and his Modern Rivals",
        link: "https://en.wikipedia.org/wiki/Euclid_and_His_Modern_Rivals"
    },
    {
        title: "He thought he saw an elephant",
        link: "https://www.thereader.org.uk/featured-poem-the-mad-gardeners-song-by-lewis-carroll/"
    },
    {
        title: "Rhyme? And Reason? (Phantasmagoria)",
        link: "https://en.wikipedia.org/wiki/Phantasmagoria_(poem)"
    },
    {
        title: "Pillow Problems",
        link: "https://www.nature.com/articles/048564b0"
    },
    {
        title: "Sylvie and Bruno",
        link: "https://en.wikipedia.org/wiki/Sylvie_and_Bruno"
    },
]
</script>