<template>
    <div class="p-4 mont flex flex-row-reverse">
        <img src="~/assets/marktwain.jpg" alt="Марк Твен" class="h-1/3 mr-4 mb-4 ml-32">
        <div class="flex flex-col">
            <p class="text-2xl pb-8">
                Марк Твен
            </p>
            <div class="text-xl mb-2">
                Марк Твен (англ. Mark Twain, вимовляється Твейн), справжнє ім'я: Сем'юел Ленггорн Клеменс (англ. Samuel Langhorne Clemens; 30 листопада 1835 Флорида, штат Міссурі — 21 квітня 1910, Реддінг, штат Коннектикут) — американський письменник, гуморист, сатирик, публіцист, видавець.            
            </div>
            <div class="mb-2">
                Найвідоміші літературні твори Твена: 
                <UButton variant="link" to="https://uk.wikipedia.org/wiki/%D0%9F%D1%80%D0%B8%D0%B3%D0%BE%D0%B4%D0%B8_%D0%A2%D0%BE%D0%BC%D0%B0_%D0%A1%D0%BE%D1%94%D1%80%D0%B0">«Пригоди Тома Соєра»</UButton>
                та
                <UButton variant="link" to="https://uk.wikipedia.org/wiki/%D0%9F%D1%80%D0%B8%D0%B3%D0%BE%D0%B4%D0%B8_%D0%93%D0%B5%D0%BA%D0%BB%D1%8C%D0%B1%D0%B5%D1%80%D1%80%D1%96_%D0%A4%D1%96%D0%BD%D0%BD%D0%B0">«Пригоди Гекльберрі Фінна»</UButton>
            </div>
            <div class="mb-4">
                Вільям Фолкнер писав, що він був «першим по-справжньому американським письменником, і всі ми відтоді — його наступники», а Ернест Хемінгуей писав, що «вся сучасна американська література вийшла з однієї книжки Марка Твена, яка називається „Пригоди Гекльберрі Фінна“».            
            </div>
            <UDivider class="text-2xl font-extrabold cursor-pointer mb-8" @click="toggleBio">Біографія</UDivider>
            <div v-if="bioExpand">
                <div class="mb-2 w-full text-center text-xl">
                    Дитинство і юність
                </div>
                <div class="mb-2">
                    Народився в сім'ї збіднілого теннессійського купця Джона-Маршала Клеменса (11 серпня 1798 — 24 березня 1847) і Джейн Лемптон-Клеменс (18 червня 1803 — 27 жовтня 1890 року). Він був шостою дитиною у сім'ї, в якій було семеро дітей і тільки четверо з них вижило.
                </div>
                <div class="mb-2">
                    Коли Маркові Твену виповнилося чотири роки, його сім'я переїхала у місто Ганнібал, де був річковий порт на Міссісіпі. Згодом Ганнібал став прообразом містечка Сент-Пітерсберг у романах «Пригоди Тома Соєра» та «Пригоди Гекльберрі Фінна». На той час штат Міссурі був рабовласницьким, тому вже тоді Марк Твен зміг ознайомитися із рабством, яке буде згодом описувати й засуджувати у своїх творах.
                </div>
                <div class="mb-2">
                    У березні 1847 року, коли Марку Твену було 12 років, його батько помер від пневмонії. Наступного року Марк почав працювати помічником у друкарні. З 1851 року займався набором (друком) і редагуванням статей та гумористичних нарисів для газети «Ганнібальський часопис», власником якої був його брат Оріон. У віці 18 років він залишив Ганнібал, працював у друкарнях Нью-Йорка, Філадельфії, Сент-Луїса та інших міст. Займався самоосвітою, багато часу проводячи в бібліотеці, таким чином отримуючи стільки знань, скільки він би зміг одержати, закінчивши звичайну школу. У віці 22 років Твен повернувся в штат Міссурі. На шляху до Нового Орлеану подорожував на пароплаві. Тоді ж у нього з'явилася мрія стати капітаном корабля. У цей час така робота була вельми високооплачуваною — середня зарплата становила $250 на місяць, що дорівнює сьогоднішнім $155 000 на рік.
                </div>
                <div class="mb-2">
                    Тоді пароплави будувалися із ненадійного легкозаймистого дерева і ніякі освітлювальні прилади, лампи, свічки вночі не були дозволені, оскільки це робило подорожі дуже ризикованими й небезпечними. Капітан пароплава мусив бути добре обізнаним із маршрутом, з берегами і портами річки, щоб у будь-якому з них бути спроможним зупинитися. Твен за два роки надзвичайно ретельно вивчив 2 000 миль (3 200 кілометрів) річки Міссісіпі і у 1859 році отримав диплом капітана корабля. Навчаючись, Семюель заохочував свого молодшого брата працювати з ним. Але Генрі загинув 21 червня 1858 року, коли пароплав, на якому він працював, вибухнув. Марк Твен передбачив цю смерть — вона йому приснилася за місяць до того. Цей випадок зацікавив його парапсихологією. Згодом він став членом Товариства Психічних Досліджень (Society for Psychical Research). Твен вважав, що він насамперед винен у смерті свого брата і почуття провини не покидало його аж до смерті. Однак він продовжував працювати на річці доти, поки не спалахнула Громадянська війна і судноплавство на Міссісіпі припинилося.
                </div>
                <div class="mb-2 w-full text-center text-xl">
                    Дезертирство
                </div>
                <div class="mb-2">
                    Йому довелося стати солдатом війська Конфедерації. Утім за два тижні він дезертирував з армії Півдня і рушив на захід, до брата в Неваду. Тоді саме пройшла чутка, що в диких преріях цього штату знайшли срібло й золото. Тут Твен працював цілий рік на срібному руднику. Паралельно він писав гумористичні оповідання для газети «Терріторіал ентерпрайз» у Вірджинія-Сіті й у серпні 1862 року одержав запрошення стати її співробітником. Тоді ж узяв собі за псевдонім вислів лотових на Міссісіпі, які викрикували «mark twain» («марка 2 фатоми»), що означало достатню глибину для безпечного плавання.
                </div>
                <div class="mb-2 w-full text-center text-xl">
                    Мандри (також в Україну)
                </div>
                <div class="mb-2">
                    Протягом декількох років він працював у різних газетах як репортер і фейлетоніст. Крім цього, він заробляв додаткові кошти публічним читанням своїх гумористичних оповідань. Як кореспонденту «Альта Каліфорнія» йому вдалося взяти участь у середземноморському круїзі на пароплаві «Квакер-Сіті», під час якого зібрав матеріал для своєї першої книги «Простаки за кордоном». Тоді ж письменник побував і на території сучасної Україні, відвідавши такі міста, як Одеса, Севастополь та Ялта. Побував також і в резиденції російського імператора в Лівадії.
                </div>
                <div class="mb-2">
                    Поява 1869 року повісті «Простаки за кордоном» викликала деякий інтерес з боку публіки через рідкісне для тих років поєднання добротного південного гумору й сатири. Таким чином, літературний дебют Марка Твена відбувся. Крім того, у лютому 1870 року він одружився із сестрою свого друга Ч. Ленгдона, з яким познайомився під час круїзу, — Олівією.
                </div>
                <div class="mb-2">
                    Наступною успішною книгою став написаний у співавторстві з Чарльзом Ворнером роман «Позолочене століття». Стилі співавторів серйозно різнилися, але з іншого боку роман припав до смаку читачам настільки, що назвою роману охрестили час правління президента Улісса Гранта. 1876 року побачила світ нова книга Твена, яка не тільки закріпила його роль видатного американського письменника, але й назавжди внесло його ім'я в історію світової літератури — «Пригоди Тома Соєра». Письменник згадав дитинство в Ганнібалі й своє життя в ті роки. І от на сторінках книги з'явилися описи містечка Сент-Пітерсберг, у якому легко можна впізнати Ганнібал, як, утім, і безліч інших дрібних населених пунктів, які розкинулися на берегах Міссісіпі. А Том Соєр був схожий на юного Семюеля Клеменса, який дуже не любив школу й у 9 років уже палив.
                </div>
                <div class="mb-2">
                    Успіх книги перевершив усі сподівання. Книга, наповнена простим гумором і написана доступною мовою, сподобалася широкому загалу звичайних американців. Це визнання читачів Твен закріпив наступною книгою, яка також не розраховувалася на витончені смаки літературних критиків. Повість «Принц і жебрак», яка вийшла друком у 1882 році, переносить читачів в Англію епохи Тюдорів. Захоплюючі пригоди поєднуються в цій повісті з мрією простого американця розбагатіти.
                </div>
                <div class="mb-2">
                    Історична тема зацікавила письменника. У передмові до свого нового роману «Янкі з Коннектикуту при дворі короля Артура» Твен написав:
                </div>
                <div class="mb-2 ml-4 flex flex-row items-center justify-around">
                    <p class="mr-4 text-4xl">«</p><p>«Якщо хто-небудь схильний засуджувати нашу сучасну цивілізацію, що ж, перешкодити цьому не можна, але непогано іноді провести порівняння між нею і тим, що робилося на світі раніш, а це повинно заспокоїти і вселити надію».</p><p class="text-4xl">»</p>
                </div>
                <div class="mb-2 w-full text-center text-xl">
                    Успішний бізнесмен
                </div>
                <div class="mb-2">
                    До 1884 року Твен був уже відомим літератором і до того ж ще і став успішним бізнесменом. Він заснував видавничу фірму, номінально очолену Ч. Л. Вебстером, чоловіком його племінниці. Однією з перших книг, що вийшли у власному видавництві, стала його «Пригоди Гекльберрі Фінна». Твір, який, за визнанням критиків, став найкращим у творчості Марка Твена, задумувався як продовження «Пригод Тома Соєра». Однак він вийшов набагато складнішим і багатошаровим. Позначилося те, що письменник створював його протягом майже 10 років. У цій книзі Твен вперше в американській літературі використав розмовну мову американської глибинки.
                </div>
                <div class="mb-2">
                    Серед інших книг, випущених видавництвом Твена, можна назвати «Спогади» вісімнадцятого президента США У. С. Гранта. Вони стали бестселером і принесли на певний час родині Твена бажане матеріальне благополуччя.
                </div>
                <div class="mb-2">
                    Видавнича фірма Твена успішно існувала аж до економічної кризи 1893 — 1894 років. Бізнес письменника не витримав жорстокого удару й збанкрутував. Але справи й до цього останнім часом йшли не блискуче. Ще в 1891 році Марк Твен із метою економії коштів був змушений перебратися в Європу. Час від часу він приїжджав до Сполучених Штатів, намагаючись виправити своє матеріальне становище. Після розорення він довго не визнавав себе банкрутом. Зрештою йому вдалося домовитися з кредиторами про відстрочку виплати боргів. Це він зміг зробити тільки 1898 року. За цей час Твен написав кілька творів, серед яких його найсерйозніша історична проза — «Особисті спогади про Жанну д'Арк» (1896), а також «Роззява Вільсон» (1894), «Том Соєр за кордоном» (1894) і «Том Соєр-детектив» (1896). Але жоден з них не мав того успіху, який мали минулі книги Твена.
                </div>
                <div class="mb-2 w-full text-center texl-xl">
                    Останні роки
                </div>
                <div class="mb-2">
                    До кінця XIX століття в США почали публікувати зібрання творів Марка Твена, ставлячи тим самим його в розряд класиків минулих днів. Однак XX-те століття Марк Твен ознаменував творами, покликаними викривати неправду й несправедливість: «Людина, що ходить у пітьмі», «Сполучені Лінчуючі Штати», «Монолог царя», «Монолог короля Леопольда в захист його панування в Конго». Проте американці, які знали його як класика «легкої» літератури, не сприйняли ці твори. 1901 року він одержав почесний ступінь доктора красного письменства від Єльського університету. У наступному році — почесний ступінь доктора права від Міссурійського університету. Він дуже пишався цими званнями. Для людини, яка у 12 років покинула школу, визнання його таланту науковою спільнотою знаменитих університетів було дуже приємним.
                </div>
                <div class="mb-2">
                    У 1906 році Твен найняв особистого секретаря, яким став А. Б. Пейн. Секретар висловив своє бажання написати книгу про життя письменника. Однак Твен і сам уже кілька разів сідав за стіл, з метою написати автобіографію. У результаті письменник почав диктувати Пейнові історію свого життя. Через рік його знову відзначили науковим ступенем. Він одержав почесний ступінь доктора красного письменства від Оксфордського університету.
                </div>
                <div class="mb-2">
                    До того часу він уже тяжко хворів, а більшість членів його родини померли один за одним. Письменника турбували жорстокі напади стенокардії. Зрештою 21 квітня 1910 року у віці 74 років Марк Твен помер.
                </div>
                <div class="mb-2">
                    Його останній твір — сатирична повість «Таємничий незнайомець» вийшла посмертно 1916 року за незавершеним рукописом.
                </div>
            </div>
            <UDivider class="text-2xl font-extrabold cursor-pointer mb-8" @click="togglePoems">Твори</UDivider>
            <div class="poems" v-if="poemsExpand">
                <div v-for="poem in poems">
                    <div class="mb-2">
                        <UButton size="lg" class="text-lg" variant="link" :to="poem.link">• {{ poem.title }}</UButton>
                    </div>
                </div>
            </div>
        </div>
    </div>
</template>
<style scoped>
</style>
<script setup>
const bioExpand = ref(false)
const poemsExpand = ref(false)
const toggleBio = () => {
    bioExpand.value = !bioExpand.value
}
const togglePoems = () => {
    poemsExpand.value = !poemsExpand.value
}
const poems = [
    {
        title: "Пригоди Тома Сойєра",
        link: "https://www.ukrlib.com.ua/world/printit.php?tid=17"
    },
    {
        title: "Янкі при дворі короля Артура",
        link: "https://www.ukrlib.com.ua/world/printit.php?tid=1095"
    },
    {
        title: "Як я редагував сільсько-господарську газету",
        link: "https://www.ukrlib.com.ua/world/printit.php?tid=492"
    },
    {
        title: "Принц і злидар",
        link: "https://www.ukrlib.com.ua/world/printit.php?tid=19"
    },
    {
        title: "Приборкання велосипеда",
        link: "https://chtyvo.org.ua/authors/Twain_Mark/Pryborkannia_velosypeda/"
    },
    {
        title: "Пригоди Гекльберрі Фінна",
        link: "https://www.ukrlib.com.ua/world/printit.php?tid=18"
    },
]
</script>